Revit 2025 API
LanguageType Enumeration
 An enumerated type containing the supported Revit product languages.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum LanguageType
Public Enumeration LanguageType
public enum class LanguageType
type LanguageType
Members
Member name | Value | Description
English_USA | 0 |  English USA.
German | 1 |  German.
Spanish | 2 |  Spanish.
French | 3 |  French.
Italian | 4 |  Italian.
Dutch | 5 |  Dutch.
Chinese_Simplified | 6 |  Chinese simplified.
Chinese_Traditional | 7 |  Chinese traditional.
Japanese | 8 |  Japanese.
Korean | 9 |  Korean.
Unknown | -1 |  Unknown.
Russian | 10 |  Russian.
Czech | 11 |  Czech.
Polish | 12 |  Polish.
Hungarian | 13 |  Hungarian.
Brazilian_Portuguese | 14 |  Brazilian Portuguese.
English_GB | 15 |  English - United Kingdom.
See Also
Reference
Autodesk.Revit.ApplicationServices Namespace